jaliquiel/BlackJack_MSP430/main.c
                state = draw;
                currKey = NULL;
                Graphics_clearDisplay(&g_sContext); // Clear the display

                // get out of switch statement
                break;
            }else if(currKey == '#'){
                state = cpu;
                currKey = NULL;
                Graphics_clearDisplay(&g_sContext); // Clear the display
                break;
            }

            break;

        case cpu: // Win or lost state
            // display celebration or loss statement


            cpuHandValue = getValue(&cpuHand, cpuHandLen);
            endGame = isOverflow(cpuHandValue);

            // CPU lost, so send player to win screen
            if(endGame == lost){
                state = winner;
                currKey = NULL;
                Graphics_clearDisplay(&g_sContext); // Clear the display
                break;
            }else if(endGame == won){
                // CPU won so send player to lost screen
                state = loser;
                currKey = NULL;
                Graphics_clearDisplay(&g_sContext); // Clear the display
                break;
            }

//
            // PRINT OUT PLAYERS HANDS
            Graphics_drawStringCentered(&g_sContext, "PLAYER 1:", AUTO_STRING_LENGTH, 48, 10, TRANSPARENT_TEXT);
            // print out player's cards
            playerHandLen = sizeof(playerHand)/sizeof(playerHand[0]);
            for (i = 0; i< playerHandLen;i++){
                if(playerHand[i][0] == '\0'){
                    break;
                }
                Graphics_drawStringCentered(&g_sContext, playerHand[i], dispSz, 20 + i*25, 20, OPAQUE_TEXT);
            }
            // print out cpu's cards
            cpuHandLen = sizeof(cpuHand)/sizeof(cpuHand[0]);
            Graphics_drawStringCentered(&g_sContext, "CPU", AUTO_STRING_LENGTH, 48, 40, TRANSPARENT_TEXT);
            for (i = 0; i< cpuHandLen;i++){
                if(cpuHand[i][0] == '\0')
                    break;
//                if (i == 1){
//                    Graphics_drawStringCentered(&g_sContext, "xxx", dispSz, 20 + i*25, 50, OPAQUE_TEXT);
//                    continue;
//                }
                // TODO FIX PRINTING OF 10s ******************************************************************************************************10
                Graphics_drawStringCentered(&g_sContext, cpuHand[i], dispSz, 20 + i*25, 50, OPAQUE_TEXT);
            }
            Graphics_flushBuffer(&g_sContext);


//            // Do CPU Action
//            // restart state
            if(cpuDraw(cpuHandValue)){
                // draw and reenter state
                // add card to player
                strcpy(cpuHand[cpuCards], getCardString(deck[topDeckIndex]));
                topDeckIndex++;
                cpuCards += 1;

                state = cpu;
                currKey = NULL;
                Graphics_clearDisplay(&g_sContext); // Clear the display
                // get out of switch statement
                break;

            }else{
                // go to final game decision state
                state = end;
                currKey = NULL;
                Graphics_clearDisplay(&g_sContext); // Clear the display
                break;

            }

            break;

        case loser: // Lost state
            // display celebration or loss statement
            // ...


            // PRINT OUT PLAYERS HANDS
            Graphics_drawStringCentered(&g_sContext, "PLAYER 1:", AUTO_STRING_LENGTH, 48, 10, TRANSPARENT_TEXT);
            // print out player's cards
            playerHandLen = sizeof(playerHand)/sizeof(playerHand[0]);
            for (i = 0; i< playerHandLen;i++){
                if(playerHand[i][0] == '\0'){
                    break;
                }
                Graphics_drawStringCentered(&g_sContext, playerHand[i], dispSz, 20 + i*25, 20, OPAQUE_TEXT);
            }
            // print out cpu's cards
            cpuHandLen = sizeof(cpuHand)/sizeof(cpuHand[0]);
            Graphics_drawStringCentered(&g_sContext, "CPU", AUTO_STRING_LENGTH, 48, 40, TRANSPARENT_TEXT);
            for (i = 0; i< cpuHandLen;i++){
                if(cpuHand[i][0] == '\0')
                    break;
//                if (i == 1){
//                    Graphics_drawStringCentered(&g_sContext, "xxx", dispSz, 20 + i*25, 50, OPAQUE_TEXT);
//                    continue;
//                }
                // TODO FIX PRINTING OF 10s ******************************************************************************************************10
                Graphics_drawStringCentered(&g_sContext, cpuHand[i], dispSz, 20 + i*25, 50, OPAQUE_TEXT);
            }
//            Graphics_flushBuffer(&g_sContext);

//            Graphics_drawStringCentered(&g_sContext, "YOU LOST", AUTO_STRING_LENGTH, 48, 10, TRANSPARENT_TEXT);
//            Graphics_drawStringCentered(&g_sContext, "YOU LOST", AUTO_STRING_LENGTH, 48, 20, TRANSPARENT_TEXT);
//            Graphics_drawStringCentered(&g_sContext, "YOU LOST", AUTO_STRING_LENGTH, 48, 30, TRANSPARENT_TEXT);
//            Graphics_drawStringCentered(&g_sContext, "YOU LOST", AUTO_STRING_LENGTH, 48, 40, TRANSPARENT_TEXT);
//            Graphics_drawStringCentered(&g_sContext, "YOU LOST", AUTO_STRING_LENGTH, 48, 50, TRANSPARENT_TEXT);
            Graphics_drawStringCentered(&g_sContext, "YOU LOST", AUTO_STRING_LENGTH, 48, 60, TRANSPARENT_TEXT);
            Graphics_drawStringCentered(&g_sContext, "YOU LOST", AUTO_STRING_LENGTH, 48, 70, TRANSPARENT_TEXT);
            Graphics_drawStringCentered(&g_sContext, "YOU LOST", AUTO_STRING_LENGTH, 48, 80, TRANSPARENT_TEXT);
            Graphics_drawStringCentered(&g_sContext, "YOU LOST", AUTO_STRING_LENGTH, 48, 90, TRANSPARENT_TEXT);
            Graphics_flushBuffer(&g_sContext);

            humiliation();

            while(currKey != '*'){
                currKey = getKey();
            }

            if(currKey == '*'){
                // RESTART ALL VARIABLES FOR NEW GAME
                Graphics_clearDisplay(&g_sContext); // Clear the display
                state = welcome;
                currKey = NULL;
                dispThree[0] = NULL;
                dispThree[1] = NULL;
                dispThree[2] = NULL;
                int i;
                for(i = 0; i < 52; i ++ ){
                    deck[i] = 0;
                }
                topDeckIndex = 0; // represents the current index of the top of the deck
                playerCards = 0;
                cpuCards = 0;
            }

            break;

        case winner: // Win state


            // PRINT OUT PLAYERS HANDS
            Graphics_drawStringCentered(&g_sContext, "PLAYER 1:", AUTO_STRING_LENGTH, 48, 10, TRANSPARENT_TEXT);
            // print out player's cards
            playerHandLen = sizeof(playerHand)/sizeof(playerHand[0]);
            for (i = 0; i< playerHandLen;i++){
                if(playerHand[i][0] == '\0'){
                    break;
                }
                Graphics_drawStringCentered(&g_sContext, playerHand[i], dispSz, 20 + i*25, 20, OPAQUE_TEXT);
            }
            // print out cpu's cards
            cpuHandLen = sizeof(cpuHand)/sizeof(cpuHand[0]);
            Graphics_drawStringCentered(&g_sContext, "CPU", AUTO_STRING_LENGTH, 48, 40, TRANSPARENT_TEXT);
            for (i = 0; i< cpuHandLen;i++){
                if(cpuHand[i][0] == '\0')
                    break;
//                if (i == 1){
//                    Graphics_drawStringCentered(&g_sContext, "xxx", dispSz, 20 + i*25, 50, OPAQUE_TEXT);
//                    continue;
//                }
                // TODO FIX PRINTING OF 10s ******************************************************************************************************10
                Graphics_drawStringCentered(&g_sContext, cpuHand[i], dispSz, 20 + i*25, 50, OPAQUE_TEXT);
            }


            // display celebration or loss statement
            Graphics_drawStringCentered(&g_sContext, "YOU WON", AUTO_STRING_LENGTH, 48, 60, TRANSPARENT_TEXT);
            Graphics_drawStringCentered(&g_sContext, "YOU WON", AUTO_STRING_LENGTH, 48, 70, TRANSPARENT_TEXT);
            Graphics_drawStringCentered(&g_sContext, "YOU WON", AUTO_STRING_LENGTH, 48, 80, TRANSPARENT_TEXT);
            Graphics_drawStringCentered(&g_sContext, "YOU WON", AUTO_STRING_LENGTH, 48, 90, TRANSPARENT_TEXT);
            Graphics_flushBuffer(&g_sContext);

