jaliquiel/BlackJack_MSP430/main.c
            //proper celebration w/ buzzer and leds
            celebration();

            while(currKey != '*'){
                currKey = getKey();
            }

            if(currKey == '*'){
                // RESTART ALL VARIABLES FOR NEW GAME
                Graphics_clearDisplay(&g_sContext); // Clear the display
                state = welcome;
                currKey = NULL;
                dispThree[0] = NULL;
                dispThree[1] = NULL;
                dispThree[2] = NULL;
                int i;
                for(i = 0; i < 52; i ++ ){
                    deck[i] = 0;
                }
                topDeckIndex = 0; // represents the current index of the top of the deck
                playerCards = 0;
                cpuCards = 0;
            }
            break;

        case end: // cpu and player holded, decide winner

            // PRINT OUT PLAYERS HANDS
            Graphics_drawStringCentered(&g_sContext, "PLAYER 1:", AUTO_STRING_LENGTH, 48, 10, TRANSPARENT_TEXT);
            // print out player's cards
            playerHandLen = sizeof(playerHand)/sizeof(playerHand[0]);
            for (i = 0; i< playerHandLen;i++){
                if(playerHand[i][0] == '\0'){
                    break;
                }
                Graphics_drawStringCentered(&g_sContext, playerHand[i], dispSz, 20 + i*25, 20, OPAQUE_TEXT);
            }
            // print out cpu's cards
            cpuHandLen = sizeof(cpuHand)/sizeof(cpuHand[0]);
            Graphics_drawStringCentered(&g_sContext, "CPU", AUTO_STRING_LENGTH, 48, 40, TRANSPARENT_TEXT);
            for (i = 0; i< cpuHandLen;i++){
                if(cpuHand[i][0] == '\0')
                    break;
//                if (i == 1){
//                    Graphics_drawStringCentered(&g_sContext, "xxx", dispSz, 20 + i*25, 50, OPAQUE_TEXT);
//                    continue;
//                }
                // TODO FIX PRINTING OF 10s ******************************************************************************************************10
                Graphics_drawStringCentered(&g_sContext, cpuHand[i], dispSz, 20 + i*25, 50, OPAQUE_TEXT);
            }
            Graphics_flushBuffer(&g_sContext);


            // calculate hand values for player and cpu
            cpuHandValue = getValue(&cpuHand, cpuHandLen);
            playerHandValue = getValue(&playerHand, playerHandLen);
            // closest hand to 21 wins
            // In this case, none of the hands are above 21 therefore, the biggest value is the closest to 21
            if (playerHandValue > cpuHandValue){
                // go to win state
                state = winner;
                currKey = NULL;
                Graphics_clearDisplay(&g_sContext); // Clear the display
                break;
            }else if (playerHandValue < cpuHandValue){
                // go to lose state
                state = loser;
                currKey = NULL;
                Graphics_clearDisplay(&g_sContext); // Clear the display
                break;
            }else{
                // draw
                Graphics_drawStringCentered(&g_sContext, "DRAW", AUTO_STRING_LENGTH, 48, 60, TRANSPARENT_TEXT);
                Graphics_drawStringCentered(&g_sContext, "DRAW", AUTO_STRING_LENGTH, 48, 70, TRANSPARENT_TEXT);
                Graphics_drawStringCentered(&g_sContext, "DRAW", AUTO_STRING_LENGTH, 48, 80, TRANSPARENT_TEXT);
                Graphics_drawStringCentered(&g_sContext, "DRAW", AUTO_STRING_LENGTH, 48, 90, TRANSPARENT_TEXT);
            }

            while(currKey != '*'){
                currKey = getKey();
            }

            if(currKey == '*'){
                // RESTART ALL VARIABLES FOR NEW GAME
                Graphics_clearDisplay(&g_sContext); // Clear the display
                state = welcome;
                currKey = NULL;
                dispThree[0] = NULL;
                dispThree[1] = NULL;
                dispThree[2] = NULL;
                int i;
                for(i = 0; i < 52; i ++ ){
                    deck[i] = 0;
                }
                topDeckIndex = 0; // represents the current index of the top of the deck
                playerCards = 0;
                cpuCards = 0;
            }
            break;

        }

    }  // end while (1)


}


unsigned char* getCardString(unsigned int card){

    // card string
    unsigned char* string = malloc(3);

    unsigned int reminder = card % 13 + 1;

    string[1] = '-';

    if (card >= 1 && card <= 13){
        // hearts
        string[2] = 'H';
    }else if (card >= 14 && card <= 26){
        // Diamonds
        string[2] = 'D';
    }else if (card >= 27 && card <= 39){
        // Clubs
        string[2] = 'C';
    }else if(card >= 40 && card <= 52){
        // Spade
        string[2] = 'S';
    }

    if(reminder == 11){
        // J
        string[0] = 'J';
    }else if(reminder == 12){
        // Q
        string[0] = 'Q';
    }else if (reminder == 13){
        // King
        string[0] = 'K';
    }else if (reminder == 1){
        // Ace
        string[0] = 'A';
    }else if(reminder == 10){
        string[0] = '1';
    }else{
        // return reminder
        string[0] = reminder + '0';
    }
    return string;
}

// given an player's hand (array of strings)
// return the corresponding value of the card
int getValue(unsigned char hand[10][3], int lenghtOfHand){
    int i;
    int totalVal = 0;
    int numberOfAs = 0; // keep track of As in our hand
    unsigned char value;

    for (i = 0; i < lenghtOfHand; i++){
        value = hand[i][0];
        if (value == 0)
            break;

        if( (value == 'J') || (value == 'K') || (value == 'Q') || (value == '1') ){
            // J
            totalVal += 10;
        }else if (value == 'A'){
            // Ace
            totalVal += 1;
            numberOfAs += 1;
        }else{
            // return reminder
             totalVal += value - '0';
        }
    }

    int distance = 21 - totalVal;
    // if one of the As can become 11 without going over 21, then update totalVal
    if ( (distance >= 10) && (numberOfAs > 0) ){
        // make one A be valued 11 instead of 10
        totalVal = totalVal + 10;
    }

