jaliquiel/BlackJack_MSP430/main.c
    return totalVal;
}

// given hand value, calculate the bet
unsigned char calculateBet(int handValue, unsigned char playerBet){

    unsigned char bet;
    if (handValue >= 2 & handValue <= 6 ){
        bet = '1';
    }else if (handValue >= 7 & handValue <= 11 ){
        bet = '2';
    }else if (handValue >= 12 & handValue <= 17 ){
        bet = '4';
    }else if (handValue >= 17 & handValue <= 21 ){
        bet = '8';
    }

    // if cpu's bet is less than opponent's bet, then equal opponent's
    if (playerBet > bet)
        bet = playerBet;

    return bet;
}


// given a value check if the hand's value is bigger than 21
// return lost if hand overflows
// won if hand == 21
// keepPlaying if hand is less than 21
int isOverflow(int value){

//    unsigned char valueChar = getValue(&hand, lenghtOfHand);
//    int value = valueChar - '0';

    if(value > 21){
        // end game player lost
        return lost;
    }else if (value == 21){
        // player won
        return won;
    }else if (value < 21){
        // player could keep going
        return keepPlaying;
    }
    // this wont happen
    return lost;
}

// takes the value of the cpu's hand, measures the distance and then decides to fold or draw
// return true if cpu wants to draw card
// false if cpu decides to hold
bool cpuDraw(int value){
    int decision;

    if (value > 17)
        return false;
    else if (value <= 11)
        return true;
    else{
        decision = rand() % 2;
        if (decision > 1){
            return true;
        }else{
            return false;
        }
    }
}

void celebration(void){
    unsigned int m = 20000;
    while(1){
        m--;
        if (m > 15000){
            BuzzerOn();
            setLeds(0x03);
        }
        else if ((m > 10000) && (m <= 15000)){
            Buzzer3On();
            setLeds(0x0C);
        }
        else if ((m > 5000) && (m <= 15000)){
            Buzzer1On();
            setLeds(0x06);
        }
        else if ((m > 0) && (m <= 5000)){
            Buzzer2On();
            setLeds(0x0F);
        }
        else if (m == 0){
            BuzzerOff();
            setLeds(0);
            return 0;
        }
    }
}

void humiliation(void){
    unsigned int m = 20000;
    while(1){
        m--;
        if (m > 15000){
            Buzzer3On();
            setLeds(0x01);
        }
        else if ((m > 10000) && (m <= 15000)){
            Buzzer2On();
            setLeds(0x03);
        }
        else if ((m > 5000) && (m <= 15000)){
            Buzzer1On();
            setLeds(0x07);
        }
        else if ((m > 0) && (m <= 5000)){
            BuzzerOn();
            setLeds(0x08);
        }
        else if (m == 0){
            BuzzerOff();
            setLeds(0);
            return 0;
        }
    }
}

void swDelay(char numLoops)
{
    // This function is a software delay. It performs
    // useless loops to waste a bit of time
    //
    // Input: numLoops = number of delay loops to execute
    // Output: none
    //
    // smj, ECE2049, 25 Aug 2013

    volatile unsigned int i,j;  // volatile to prevent removal in optimization
                                // by compiler. Functionally this is useless code

    for (j=0; j<numLoops; j++)
    {
        i = 50000 ;                 // SW Delay
        while (i > 0)               // could also have used while (i)
           i--;
    }
}



